plugins/HisInOne/test.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:ns1="http://www.his.de/ws/StudIPService"
                   xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <SOAP-ENV:Header>
        <ns2:wsse:Security>
            <UsernameToken>
                <item>
                    <key>wsse:Username</key>
                    <value>
                        <item>
                            <key>_</key>
                            <value>soap</value>
                        </item>
                    </value>
                </item>
                <item>
                    <key>wsse:Password</key>
                    <value>
                        <item>
                            <key>Type</key>
                            <value>http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText</value>
                        </item>
                        <item>
                            <key>_</key>
                            <value>xxx</value>
                        </item>
                    </value>
                </item>
            </UsernameToken>
        </ns2:wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body><ns1:readOrgunit><ns1:lid xsi:nil="true"/><ns1:versionDate xsi:nil="true"/></ns1:readOrgunit></SOAP-ENV:Body></SOAP-ENV:Envelope>
